package com.application.ptsdwebapplication.data;

// Еженедельный
public class QuestionnaireDataIESR {

    public static String[] Questions = {
        "Любое напоминание об этом событии заставляло меня заново переживать всё случившееся.",
        "Я не мог спокойно спать по ночам.",
        "Некоторые вещи заставляли меня всё время думать о том, что со мной случилось.",
        "Я чувствовал постоянное раздражение и гнев.",
        "Я не позволял себе расстраиваться, когда думал об этом событии или что то напоминало мне о нём.",
        "Я думал о случившемся против своей воли.",
        "Мне казалось, что всего случившегося как будто бы не было на самом деле или всё, что тогда происходило, было нереальным.",
        "Я старался избегать всего, что напоминало мне о случившемся.",
        "Отдельные картины случившегося внезапно возникали в сознании.",
        "Я был всё время напряжен и сильно вздрагивал, если что то внезапно пугало меня.",
        "Я старался не думать о случившемся.",
        "Я понимал, что меня до сих пор буквально переполняют тяжёлые переживания по поводу того, что случилось, но ничего не делал, чтобы их избежать.",
        "Я чувствовал что то вроде оцепенения, и все мои переживания по поводу случившегося были как будто парализованы.",
        "Я вдруг замечал, что действую или чувствую себя так, как будто бы всё ещё нахожусь в этой ситуации.",
        "Мне было трудно заснуть.",
        "Меня буквально захлёстывали непереносимо тяжёлые переживания, связанные с той ситуацией.",
        "Я старался вытеснить случившееся из памяти.",
        "Мне было трудно сосредоточить своё внимание на чём либо.",
        "Когда что то напоминало мне о случившемся, я испытывал неприятные физические ощущения – потел, дыхание сбивалось, начинало тошнить, учащался пульс и т. д.",
        "Мне снились тяжёлые сны о том, что со мной случилось.",
        "Я был постояно насторожен и всё время ожидал, что случится что то плохое.",
        "Я старался ни с кем не говорить о случившемся."
    };

    public static String[] AnswerOptions = {
        "Никогда",
        "Редко",
        "Иногда",
        "Часто"
    };

}
