package com.application.ptsdwebapplication.data;

// Еженедельный
public class QuestionnaireDataBHS {
    
    public static String[] Questions = {
        "Я смотрю в будущее с надеждой и энтузиазмом",
        "С тем же успехом я мог бы сдаться, потому что я не смогу сделать свою жизнь лучше.",
        "Когда дела идут плохо, мне помогает мысль, что так не может продолжаться вечно.",
        "Я не могу представить, какой будет моя жизнь через 10 лет.",
        "Мне хватает времени, чтобы успевать делать то, что я хочу.",
        "В будущем я рассчитываю добиться успеха в том, что больше всего для меня важно.",
        "Мое будущее кажется мне мрачным. ",
        "Я удачливый и ожидаю от жизни больше хорошего, чем обычный человек.",
        "Я не могу быть успешным сейчас и не вижу оснований для успеха в будущем.",
        "Мой прошлый жизненный опыт хорошо подготовил меня к будущему.",
        "Всё, что я вижу впереди, это скорее неприятности, чем радости.",
        "Я не ожидаю получить то, что действительно хочу. ",
        "Когда я думаю о будущем, я ожидаю, что буду счастливее, чем сейчас",
        "Дела идут совсем не так, как я хочу.",
        "Я очень верю в своё будущее.",
        "Я никогда не получаю того, чего хочу, поэтому глупо чего-то хотеть.",
        "Очень маловероятно, что в будущем меня ждет хоть какое-то реальное удовлетворение.",
        "Будущее кажется мне туманным и неопределенным.",
        "В будущем я могу ожидать больше хороших дней, чем плохих.",
        "Нет смысла пытаться получить что-либо из того, что я хочу, потому что вряд ли я добьюсь этого."
    };

    public static String[] AnswerOptions = {
        "Верно",
        "Неверно"
    };

}
